using static System.Console;
using SceneStructerDemo.Scenes;


namespace SceneStructerDemo
{

    class TitleScene : Scene
    {
        string TitleArt = @"
██╗░░██╗██╗███╗░░██╗░██████╗░██████╗░░█████╗░███╗░░░███╗  ░█████╗░███████╗
██║░██╔╝██║████╗░██║██╔════╝░██╔══██╗██╔══██╗████╗░████║  ██╔══██╗██╔════╝
█████═╝░██║██╔██╗██║██║░░██╗░██║░░██║██║░░██║██╔████╔██║  ██║░░██║█████╗░░
██╔═██╗░██║██║╚████║██║░░╚██╗██║░░██║██║░░██║██║╚██╔╝██║  ██║░░██║██╔══╝░░
██║░╚██╗██║██║░╚███║╚██████╔╝██████╔╝╚█████╔╝██║░╚═╝░██║  ╚█████╔╝██║░░░░░
╚═╝░░╚═╝╚═╝╚═╝░░╚══╝░╚═════╝░╚═════╝░░╚════╝░╚═╝░░░░░╚═╝  ░╚════╝░╚═╝░░░░░

██████╗░░█████╗░██████╗░██╗░░██╗███╗░░██╗███████╗░██████╗░██████╗
██╔══██╗██╔══██╗██╔══██╗██║░██╔╝████╗░██║██╔════╝██╔════╝██╔════╝
██║░░██║███████║██████╔╝█████═╝░██╔██╗██║█████╗░░╚█████╗░╚█████╗░
██║░░██║██╔══██║██╔══██╗██╔═██╗░██║╚████║██╔══╝░░░╚═══██╗░╚═══██╗
██████╔╝██║░░██║██║░░██║██║░╚██╗██║░╚███║███████╗██████╔╝██████╔╝
╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝╚══════╝╚═════╝░╚═════╝░
";
        public TitleScene(Game game) : base(game)
        {
        }

        public override void Run()
        {
            // WriteLine("Пролог начинается");      
            string promt = $@"{TitleArt}
Добро пожаловать в игру. Что будешь делать?

(Управление на 'w a s d' и Enter для выбора.)";

            string[] options = { "Играть", "Об игре", "Выйти" };//  строки главного меню
            Menu menu = new Menu(promt, options);
            int selectedIndex = menu.Run();
            switch (selectedIndex) // как туда попадаем
            {
                case 0:
                    Clear();
                    MyGame.MyRaceScene.Run();
                    break;
                case 1:
                    DisplayAboutInfo();
                    break;
                case 2:
                    MyGame.MyExitScene.Run();
                    break;

            }
        }


        private void DisplayAboutInfo() // инфа об игре
        {
            Clear();
            WriteLine(@"
Управление:                              Разработчики: ПИУ ПИУ
W - Вверх                               
A - Влево                                
S - Вниз                                 
D - Вправо
1 - Атака


Об игре:
Игру можно пройти, получив 10 уровень(максимальный) и зайдя в портал.
Уровень и другие характеристики повышаются у торговца за монеты.
Монеты можно получить в бою (от 50 до 150).
Каждый заход в портал увеличивает уровень врагов и их характеристики.

");

            ConsoleUtils.WaitForKeyPress();
            Run();
        }

    }
}
